<?php

echo "Этот текст будет зашифрован: " . $eto="карл у клары украл укулеле" . PHP_EOL;

$naeto = array (
    "а" => "6",
    "б" => "5",
    "в" => "4",
    "г" => "3",
    "д" => "2",
    "е" => "1",
    "ё" => "z",
    "ж" => "y",
    "з" => "x",
    "и" => "w",
    "й" => "v",
    "к" => "u",
    "л" => "t",
    "м" => "s",
    "н" => "r",
    "о" => "q",
    "п" => "p",
    "р" => "o",
    "с" => "n",
    "т" => "m",
    "у" => "l",
    "ф" => "k",
    "х" => "j",
    "ч" => "i",
    "ц" => "h",
    "щ" => "g",
    "Ъ" => "f",
    "ы" => "e",
    "ь" => "d",
    "э" => "c",
    "ю" => "b",
    "я" => "a"
    );
$magic = strtr ($eto, $naeto);
echo "Шифр: ".$magic . PHP_EOL;
$rash=array_flip ($naeto);
echo "Расшифровка: " . $magic = strtr ($magic, $rash);
